STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread/STM32_WPAN/App/app_thread.c
  if(valid == true)
  {
    LOG_INFO_APP("PAYLOAD Comparison OK!");
  }
  else
  {
    APP_THREAD_Error(ERR_THREAD_MSG_COMPARE_FAILED, 0);
  }
  
  return valid;
}

#ifdef APP_THREAD_PERIODIC_TRANSMIT
/**
 * @brief  Set Task associated to the joystick right button.
 * @param  arg
 * @retval None
 */
static void APP_THREAD_SetJoystickRightAction(void *arg)
{
  UTIL_SEQ_SetTask(TASK_BSP_JOY_RIGHT, CFG_SEQ_PRIO_1);
}
#endif

static void APP_THREAD_AppInit(void)
{
  UTIL_SEQ_SetTask(TASK_BSP_JOY_LEFT, CFG_SEQ_PRIO_0);
#ifdef APP_THREAD_PERIODIC_TRANSMIT
  /* Create timer to handle periodic CoAp msg transmission */

  UTIL_TIMER_Create(&APP_Thread_transmitTimerId,
                    0,
                    UTIL_TIMER_PERIODIC,
                    &APP_THREAD_SetJoystickRightAction,
                    0);
#endif
}

/**
 * @brief Task associated to the joystick right button.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickRightAction(void)
{
  /* USER CODE BEGIN JoystickRightAction */
#ifdef APP_THREAD_PERIODIC_TRANSMIT
  /* If timer for periodic CoAp msg transmission is not running */
  if (UTIL_TIMER_IsRunning(&APP_Thread_transmitTimerId) == 0U)
  {
    /* Start timer for periodic CoAp msg transmission */
    UTIL_TIMER_StartWithPeriod(&APP_Thread_transmitTimerId, APP_Thread_TransmitPeriod_ms);
    LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer started");
  }
#endif
  
  if(APP_Thread_CoapType == OT_COAP_TYPE_NON_CONFIRMABLE)
  {
    LOG_INFO_APP("Send a CoAP NON-CONFIRMABLE PUT Request");
  }
  else if (APP_Thread_CoapType == OT_COAP_TYPE_CONFIRMABLE)
  {
    LOG_INFO_APP("Send a CoAP CONFIRMABLE PUT Request");
  }

  if(APP_Thread_CoapPayloadLength_byte != COAP_PAYLOAD_LENGTH)
  {
	  APP_THREAD_InitPayloadWrite();
  }
  APP_THREAD_CoapSendRequest(&OT_Ressource, APP_Thread_CoapType, OT_COAP_CODE_PUT, MULTICAST_FTD_MED,
                              NULL, PayloadWrite, APP_Thread_CoapPayloadLength_byte, NULL, NULL);
  /* USER CODE END JoystickRightAction */
}

/**
 * @brief This function manages the data response handler.
 *
 * @param pHeader  context
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param result error code
 * @retval None
 */
static void APP_THREAD_CoapDataRespHandler( void                * pContext,
                                            otMessage           * pMessage,
                                            const otMessageInfo * pMessageInfo,
                                            otError               result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pMessage);
  UNUSED(pMessageInfo);

  if (result == OT_ERROR_NONE)
  {
    LOG_INFO_APP("APP_THREAD_CoapDataRespHandler : NO ERROR");
  }
  else
  {
    LOG_WARNING_APP("APP_THREAD_CoapDataRespHandler : WARNING. Result = %d",result);
  }
}

/**
 * @brief Task associated to the joystick left button.
 * @param  None
 * @retval None
 */
void APP_BSP_JoystickLeftAction(void)
{
  LOG_INFO_APP("Send a CoAP CONFIRMABLE PUT Request");
#ifdef APP_THREAD_PERIODIC_TRANSMIT
  /* USER CODE BEGIN JoystickLeftAction */
  UTIL_TIMER_Stop(&APP_Thread_transmitTimerId);
  LOG_INFO_APP("INFO: PERIODIC_TRANSMIT timer stopped");
  /* USER CODE END JoystickLeftAction */
#endif
  /* Send a CONFIRMABLE PUT Request */
  APP_THREAD_CoapSendRequest(&OT_Ressource, OT_COAP_TYPE_CONFIRMABLE, OT_COAP_CODE_PUT, MULTICAST_FTD_MED,
                             NULL, PayloadWrite, APP_Thread_CoapPayloadLength_byte, APP_THREAD_CoapDataRespHandler, NULL);
}


/**
 * @brief Task associated to the COAP message rate change command.
 * @param  None
 * @retval None
 */
void APP_BSP_CoapMsgRateAction(void)
{
#ifdef APP_THREAD_PERIODIC_TRANSMIT
  /* If timer for periodic CoAp msg transmission is running, then restart it with the new configured period */
  if (UTIL_TIMER_IsRunning(&APP_Thread_transmitTimerId) == 1U)
  {
    UTIL_TIMER_Stop(&APP_Thread_transmitTimerId);
    UTIL_TIMER_StartWithPeriod(&APP_Thread_transmitTimerId, APP_Thread_TransmitPeriod_ms);
  }
#endif
}

/* USER CODE END FD_LOCAL_FUNCTIONS */

